Examinator/src/Catalogs/ВидыМероприятийСУО/ВидыМероприятийСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыМероприятийСУО</name>
  <predefined>
    <items>
      <name>НаОсновеЭлектронногоРесурса</name>
      <description>Электронное обучение</description>
    </items>
  </predefined>
  <attributes>
    <name>Общее</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Скрыть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыставляетсяОценка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Электронное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПреподаватель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершатьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗавершаетУчащийся</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПрогрессЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйБаллЗавершенияУчащимся</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоФайловДляЗавершенияУчастником</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьУчащимсяПрикреплятьФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗапланированного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветАктивного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗавершенного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветОтмененного</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьРезультатыТестированияПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОтветыВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьОценкуВРезультатахТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗакрытьДоступКМатериаламПослеЗавершения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданияПроверяютсяВыборочно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>ШкалаОценки</name>
    <type>
      <types>CatalogRef.ШкалыОценокСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьПодробныеСведенияОЗадании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяИзученияЭлектронныхКурсов</name>
    <type>
      <types>EnumRef.ВариантыОтображенияВремениИзученияЭлектронногоРесурсаСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьТекущуюОценку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПодчиненное</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОбязательныеСвойстваУчастников</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Examinator/src/CommonForms/НастройкиПроведенияОбученияОО/Module.bsl
#Область ОбработчикиСобытийФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолучитьНастройкиВидаОбучения();
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура ЗавершаетУчащийсяПриИзменении(Элемент)
	СохранитьНастройкиВидаОбучения();
КонецПроцедуры

&НаКлиенте
Процедура ЗавершатьАвтоматическиПриИзменении(Элемент)	
	СохранитьНастройкиВидаОбучения();
КонецПроцедуры

&НаКлиенте
Процедура ТребуетсяПреподавательПриИзменении(Элемент)
	СохранитьНастройкиВидаОбучения();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ПолучитьНастройкиВидаОбучения() Экспорт
	
	ЗавершаетУчащийся = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ЗавершаетУчащийся;
	ЗавершатьАвтоматически = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ЗавершатьАвтоматически;
	ТребуетсяПреподаватель = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ТребуетсяПреподаватель;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиВидаОбучения() Экспорт
	
	ВидОбученияОбъект = Справочники.ВидыМероприятийСУО.НаОсновеЭлектронногоРесурса.ПолучитьОбъект();
	ВидОбученияОбъект.ЗавершаетУчащийся = ЗавершаетУчащийся;
	ВидОбученияОбъект.ЗавершатьАвтоматически = ЗавершатьАвтоматически;
	ВидОбученияОбъект.ТребуетсяПреподаватель = ТребуетсяПреподаватель;
	
	Если ВидОбученияОбъект.ПроверитьЗаполнение() Тогда	
		ВидОбученияОбъект.Записать();
	Иначе
		ПолучитьНастройкиВидаОбучения();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
